/*
 * Ascent MMORPG Server
 * Copyright (C) 2005-2007 Ascent Team <http://www.ascentemu.com/>
 *
 * This program is free software: you can redistribute it and/or modify
 * it under the terms of the GNU Affero General Public License as published by
 * the Free Software Foundation, either version 3 of the License, or
 * any later version.
 *
 * This program is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 * GNU Affero General Public License for more details.
 *
 * You should have received a copy of the GNU Affero General Public License
 * along with this program.  If not, see <http://www.gnu.org/licenses/>.
 *
 */

#ifndef __SPELLSTORE_H
#define __SPELLSTORE_H

#include "Common.h"
#include "DataStore.h"
#include "Timer.h"

#pragma pack(push,1)

struct ItemSetEntry
{
    uint32 id;                  //1
    char* name;                //2
    //uint32 unused_shit[15];      //3 - 9
    uint32 flag;                //10 constant
    uint32 itemid[8];           //11 - 18
    //uint32 more_unused_shit[9]; //19 - 27
    uint32 SpellID[8];          //28 - 35
    uint32 itemscount[8];       //36 - 43
    uint32 RequiredSkillID;     //44
    uint32 RequiredSkillAmt;    //45
};

struct Lock
{
    uint32 Id;
    uint32 locktype[5]; // 0 - no lock, 1 - item needed for lock, 2 - min lockping skill needed
    //uint32 unk1[3];
    uint32 lockmisc[5]; // if type is 1 here is a item to unlock, else is unknow for now
    //uint32 unk2[3];
    uint32 minlockskill[5]; // min skill in lockpiking to unlock.
    //uint32 unk3[11];
};

struct emoteentry
{
    uint32 Id;
    //uint32 name;
    uint32 textid;
    uint32 textid2;
    uint32 textid3;
    uint32 textid4;
    //uint32 unk1;
    uint32 textid5;
    //uint32 unk2;
    uint32 textid6;
    //uint32 unk3;
    //uint32 unk4;
    //uint32 unk5;
    //uint32 unk6;
    //uint32 unk7;
    //uint32 unk8;
    //uint32 unk9;
    //uint32 unk10;
    //uint32 unk11;
};

struct skilllinespell //SkillLineAbility.dbc
{
    uint32 Id;
    uint32 skilline;
    uint32 spell;
    //uint32 unk1;
    //uint32 unk2;
    //uint32 unk3;
    //uint32 unk4;
    //uint32 unk5;
    uint32 next;
    uint32 minrank;
    uint32 grey;
    uint32 green;
    //uint32 unk10;
    //uint32 unk11;
    uint32 reqTP;
};

struct EnchantEntry
{
    uint32 Id;
    uint32 type[3];
    int32 min[3];//for compat, in practice min==max
    int32 max[3];
    uint32 spell[3];
    char* Name;
    //uint32 NameAlt1;
    //uint32 NameAlt2;
    //uint32 NameAlt3;
    //uint32 NameAlt4;
    //uint32 NameAlt5;
    //uint32 NameAlt6;
    //uint32 NameAlt7;
    //uint32 NameAlt8;
    //uint32 NameAlt9;
    //uint32 NameAlt10;
    //uint32 NameAlt11;
    //uint32 NameAlt12;
    //uint32 NameAlt13;
    //uint32 NameAlt14;
    //uint32 NameAlt15;
    //uint32 NameFlags;
    uint32 visual;
    uint32 EnchantGroups;
    uint32 GemEntry;
    uint32 unk7;//Gem Related

};

struct GemPropertyEntry{
    uint32 Entry;
    uint32 EnchantmentID;
    uint32 unk1;//bool
    uint32 unk2;//bool
    uint32 SocketMask;
};

struct skilllineentry //SkillLine.dbc
{
    uint32 id;
    uint32 type;
    uint32 unk1;
    char* Name;
    //int32 NameAlt1;
    //uint32 NameAlt2;
    //uint32 NameAlt3;
    //uint32 NameAlt4;
    //uint32 NameAlt5;
    //uint32 NameAlt6;
    //uint32 NameAlt7;
    //uint32 NameAlt8;
    //uint32 NameAlt9;
    //uint32 NameAlt10;
    //uint32 NameAlt11;
    //uint32 NameAlt12;
    //uint32 NameAlt13;
    //uint32 NameAlt14;
    //uint32 NameAlt15;
    //uint32 NameFlags;
    //uint32 Description;
    //uint32 DescriptionAlt1;
    //uint32 DescriptionAlt2;
    //uint32 DescriptionAlt3;
    //uint32 DescriptionAlt4;
    //uint32 DescriptionAlt5;
    //uint32 DescriptionAlt6;
    //uint32 DescriptionAlt7;
    //uint32 DescriptionAlt8;
    //uint32 DescriptionAlt9;
    //uint32 DescriptionAlt10;
    //uint32 DescriptionAlt11;
    //uint32 DescriptionAlt12;
    //uint32 DescriptionAlt13;
    //uint32 DescriptionAlt14;
    //uint32 DescriptionAlt15;
    //uint32 DescriptionFlags;
    //uint32 unk2;

};

// Struct for the entry in Spell.dbc
struct SpellEntry
{
    uint32 Id;                              //1
    uint32 School;                          //2
    uint32 Category;                        //3
    uint32 field4;                          //4 something like spelltype 0: general spells 1: Pet spells 2: Disguise / transormation spells 3: enchantment spells
    uint32 DispelType;                      //5
    uint32 MechanicsType;                   //6
    uint32 Attributes;                      //7
    uint32 AttributesEx;                    //8
    uint32 Flags3;                          //9
    uint32 Flags4;                          //10 // Flags to
    uint32 field11;                         //11 // Flags....
    uint32 unk201_1;                        //12 // Flags 2.0.1 unknown one
    uint32 RequiredShapeShift;              //13 // Flags BitMask for shapeshift spells
    uint32 UNK14;                           //14-> this is wrong // Flags BitMask for which shapeshift forms this spell can NOT be used in.
    uint32 Targets;                         //15 - N / M
    uint32 TargetCreatureType;              //16
    uint32 RequiresSpellFocus;              //17
    uint32 CasterAuraState;                 //18
    uint32 TargetAuraState;                 //19
    uint32 unk201_2;                        //20 2.0.1 unknown two
    uint32 unk201_3;                        //21 2.0.1 unknown three
    uint32 CastingTimeIndex;                //22
    uint32 RecoveryTime;                    //23
    uint32 CategoryRecoveryTime;            //24 recoverytime
    uint32 InterruptFlags;                  //25
    uint32 AuraInterruptFlags;              //26
    uint32 ChannelInterruptFlags;           //27
    uint32 procFlags;                       //28
    uint32 procChance;                      //29
    int32 procCharges;                      //30
    uint32 maxLevel;                        //31
    uint32 baseLevel;                       //32
    uint32 spellLevel;                      //33
    uint32 DurationIndex;                   //34
    uint32 powerType;                       //35
    uint32 manaCost;                        //36
    uint32 manaCostPerlevel;                //37
    uint32 manaPerSecond;                   //38
    uint32 manaPerSecondPerLevel;           //39
    uint32 rangeIndex;                      //40
    float  speed;                           //41
    uint32 modalNextSpell;                  //42
    uint32 maxstack;                        //43
    uint32 Totem[2];                        //44 - 45
    uint32 Reagent[8];                      //46 - 53
    uint32 ReagentCount[8];                 //54 - 61
    uint32 EquippedItemClass;               //62
    uint32 EquippedItemSubClass;            //63
    uint32 RequiredItemFlags;               //64
    uint32 Effect[3];                       //65 - 67
    uint32 EffectDieSides[3];               //68 - 70
    uint32 EffectBaseDice[3];               //71 - 73
    float  EffectDicePerLevel[3];           //74 - 76
    float  EffectRealPointsPerLevel[3];     //77 - 79
    int32  EffectBasePoints[3];             //80 - 82
    int32  EffectMechanic[3];               //83 - 85       Related to SpellMechanic.dbc
    uint32 EffectImplicitTargetA[3];        //86 - 88
    uint32 EffectImplicitTargetB[3];        //89 - 91
    uint32 EffectRadiusIndex[3];            //92 - 94
    uint32 EffectApplyAuraName[3];          //95 - 97
    uint32 EffectAmplitude[3];              //98 - 100
    float  Effectunknown[3];                //101 - 103     This value is the $ value from description
    uint32 EffectChainTarget[3];            //104 - 106
    uint32 EffectSpellGroupRelation[3];     //107 - 109     Not sure maybe we should rename it. its the relation to field: SpellGroupType
    uint32 EffectMiscValue[3];              //110 - 112
    uint32 EffectTriggerSpell[3];           //113 - 115
    float  EffectPointsPerComboPoint[3];    //116 - 118
    uint32 SpellVisual;                     //119
    uint32 field114;                        //120
    uint32 dummy;                           //121
    uint32 CoSpell;                         //122   activeIconID;
    uint32 spellPriority;                   //123
    char* Name;                             //124
    //uint32 NameAlt1;                        //125
    //uint32 NameAlt2;                        //126
    //uint32 NameAlt3;                        //127
    //uint32 NameAlt4;                        //128
    //uint32 NameAlt5;                        //129
    //uint32 NameAlt6;                        //130
    //uint32 NameAlt7;                        //131
    //uint32 NameAlt8;                        //132
    //uint32 NameAlt9;                        //133
    //uint32 NameAlt10;                       //134
    //uint32 NameAlt11;                       //135
    //uint32 NameAlt12;                       //136
    //uint32 NameAlt13;                       //137
    //uint32 NameAlt14;                       //138
    //uint32 NameAlt15;                       //139
    //uint32 NameFlags;                       //140
	char * Rank;                            //141
    //uint32 RankAlt1;                        //142
    //uint32 RankAlt2;                        //143
    //uint32 RankAlt3;                        //144
    //uint32 RankAlt4;                        //145
    //uint32 RankAlt5;                        //146
    //uint32 RankAlt6;                        //147
    //uint32 RankAlt7;                        //148
    //uint32 RankAlt8;                        //149
    //uint32 RankAlt9;                        //150
    //uint32 RankAlt10;                       //151
    //uint32 RankAlt11;                       //152
    //uint32 RankAlt12;                       //153
    //uint32 RankAlt13;                       //154
    //uint32 RankAlt14;                       //155
    //uint32 RankAlt15;                       //156
    //uint32 RankFlags;                       //157
    char * Description;                     //158
    //uint32 DescriptionAlt1;                 //159
    //uint32 DescriptionAlt2;                 //160
    //uint32 DescriptionAlt3;                 //161
    //uint32 DescriptionAlt4;                 //162
    //uint32 DescriptionAlt5;                 //163
    //uint32 DescriptionAlt6;                 //164
    //uint32 DescriptionAlt7;                 //165
    //uint32 DescriptionAlt8;                 //166
    //uint32 DescriptionAlt9;                 //167
    //uint32 DescriptionAlt10;                //168
    //uint32 DescriptionAlt11;                //169
    //uint32 DescriptionAlt12;                //170
    //uint32 DescriptionAlt13;                //171
    //uint32 DescriptionAlt14;                //172
    //uint32 DescriptionAlt15;                //173
    //uint32 DescriptionFlags;                //174
    char * BuffDescription;                 //175
    //uint32 BuffDescriptionAlt1;             //176
    //uint32 BuffDescriptionAlt2;             //177
    //uint32 BuffDescriptionAlt3;             //178
    //uint32 BuffDescriptionAlt4;             //179
    //uint32 BuffDescriptionAlt5;             //180
    //uint32 BuffDescriptionAlt6;             //181
    //uint32 BuffDescriptionAlt7;             //182
    //uint32 BuffDescriptionAlt8;             //183
    //uint32 BuffDescriptionAlt9;             //184
    //uint32 BuffDescriptionAlt10;            //185
    //uint32 BuffDescriptionAlt11;            //186
    //uint32 BuffDescriptionAlt12;            //187
    //uint32 BuffDescriptionAlt13;            //188
    //uint32 BuffDescriptionAlt14;            //189
	//uint32 BuffDescriptionAlt15;            //190
	//uint32 buffdescflags;                   //191
    uint32 ManaCostPercentage;              //192
    uint32 unkflags;                        //193 
    uint32 StartRecoveryTime;               //194
    uint32 StartRecoveryCategory;           //195
    uint32 SpellFamilyName;                 //196
	uint64 SpellGroupType;					//197+198
    uint32 MaxTargets;                      //199 
    uint32 Spell_Dmg_Type;                  //200   dmg_class Integer      0=None, 1=Magic, 2=Melee, 3=Ranged
    uint32 FG;                              //201   0,1,2 related to Spell_Dmg_Type I think
    int32 FH;                               //202   related to paladin aura's 
    float dmg_multiplier[3];                //203 - 205   if the name is correct I dono
    uint32 FL;                              //206   only one spellid:6994 has this value = 369
    uint32 FM;                              //207   only one spellid:6994 has this value = 4
    uint32 FN;                              //208   only one spellid:26869  has this flag = 1   
    uint32 unk201_4;						//209 
    uint32 unk201_5;						//210 
    uint32 unk201_6;						//211 

    /// CUSTOM: these fields are used for the modifications made in the world.cpp
    uint32 DiminishStatus;                  //
    uint32 proc_interval;                   //!!! CUSTOM, <Fill description for variable>
    uint32 buffIndexType;					//!!! CUSTOM, <Fill description for variable>
    uint32 c_is_flags;						//!!! CUSTOM, store spell checks in a static way : isdamageind,ishealing
    uint32 buffType;                        //!!! CUSTOM, these are related to creating a item through a spell
    uint32 RankNumber;                      //!!! CUSTOM, this protects players from having >1 rank of a spell
    uint32 NameHash;                        //!!! CUSTOM, related to custom spells, summon spell quest related spells
    float base_range_or_radius_sqr;         //!!! CUSTOM, needed for aoe spells most of the time
	uint32 talent_tree;						//!!! CUSTOM,
	bool removable_by_immunity;				//!!! CUSTOM,
	uint32 in_front_status;					//!!! CUSTOM,
